W7D2/musicapp/app/views/bands/show.html.erb


<% if @band.albums.length > 0 %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 7]]