W7D2/musicapp/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @album = Album.find_by(id: params[:id])