W7D2/musicapp/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Little Chilis"], ["updated_at", "2021-03-03 04:28:21.941789"], ["id", 2]]
---
    def update
        @band = Band.find_by(id: params[:id])
        if @band.update(band_params)